<a href="https://colab.research.google.com/github/rkauraiya1167/walmart-hackathon-2020/blob/master/Walmart_hackathon_2020.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import numpy
import pandas as pd
import notebook

In [8]:
nba = pd.read_csv("dataset.csv")

In [9]:
nba.head()

   Item_id  Base_Price  Base_Units  Price1  ...  Price3  Units3  Price4  Units4
0        1          54          79      52  ...      46     122      44     137
1        2          56         803      54  ...      48    1177      45    1302
2        3          48         563      46  ...      41     833      39     923
3        4          49          65      47  ...      42      82      40      87
4        5          22         497      21  ...      19     771      18     862

[5 rows x 11 columns]

In [10]:
nba.describe()

          Item_id  Base_Price  Base_Units  ...       Units3      Price4       Units4
count  300.000000  300.000000  300.000000  ...   300.000000  300.000000   300.000000
mean   150.500000   40.063333  481.093333  ...   665.543333   32.463333   726.873333
std     86.746758   11.828456  254.868905  ...   358.265780    9.496452   394.604960
min      1.000000   20.000000   50.000000  ...    62.000000   16.000000    65.000000
25%     75.750000   30.000000  251.750000  ...   349.000000   24.000000   384.250000
50%    150.500000   41.000000  489.000000  ...   653.000000   33.000000   710.500000
75%    225.250000   50.000000  700.750000  ...   977.750000   40.000000  1057.000000
max    300.000000   60.000000  949.000000  ...  1443.000000   48.000000  1612.000000

[8 rows x 11 columns]